share/man/man4/iavf.4
.\" $OpenBSD: iavf.4,v 1.3 2019/08/04 06:55:42 jmc Exp $
.\"
.\" Copyright (c) 2019 Jonathan Matthew <jmatthew@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 4 2019 $
.Dt IAVF 4
.Os
.Sh NAME
.Nm iavf
.Nd Intel Ethernet adaptive virtual function device
.Sh SYNOPSIS
.Cd "iavf* at pci?"
.Sh DESCRIPTION
The
.Nm
driver supports the SR-IOV virtual functions of Intel 700 series Ethernet
controller devices, and newer product families.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr pci 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 6.6 .
.Sh AUTHORS
The
.Nm
driver was written by
.An David Gwynne Aq Mt dlg@openbsd.org
and
.An Jonathan Matthew Aq Mt jmatthew@openbsd.org .
